-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 17, 2022 at 12:14 AM
-- Server version: 10.4.17-MariaDB
-- PHP Version: 7.3.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `agriculturedb`
--

-- --------------------------------------------------------

--
-- Table structure for table `krishi`
--

CREATE TABLE `krishi` (
  `userid` int(10) NOT NULL,
  `firstname` varchar(20) NOT NULL,
  `lastname` varchar(20) NOT NULL,
  `phonenumber` varchar(15) NOT NULL,
  `tole` varchar(20) NOT NULL,
  `napagapa` varchar(30) NOT NULL,
  `district` varchar(30) NOT NULL,
  `province` varchar(25) NOT NULL,
  `usertype` varchar(10) NOT NULL,
  `password` varchar(20) NOT NULL,
  `dalahan` varchar(2) NOT NULL,
  `tarkari` varchar(2) NOT NULL,
  `chau` varchar(2) NOT NULL,
  `telhan` varchar(2) NOT NULL,
  `gai` varchar(2) NOT NULL,
  `vaisi` varchar(2) NOT NULL,
  `bakhra` varchar(2) NOT NULL,
  `khukhura` varchar(2) NOT NULL,
  `kukur` varchar(2) NOT NULL,
  `macha` varchar(2) NOT NULL,
  `others` varchar(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `krishi`
--

INSERT INTO `krishi` (`userid`, `firstname`, `lastname`, `phonenumber`, `tole`, `napagapa`, `district`, `province`, `usertype`, `password`, `dalahan`, `tarkari`, `chau`, `telhan`, `gai`, `vaisi`, `bakhra`, `khukhura`, `kukur`, `macha`, `others`) VALUES
(1, 'Sagun', 'Rayamajhi', '9844042581', 'madhutar', 'kamalamai', 'sindhuli', 'Bagmati', 'कृषक', 'abs', '1', '0', '1', '0', '0', '0', '0', '1', '0', '0', '0'),
(2, 'Suman ', 'Magar', '9844042883', 'madhutar', 'kamalamai', 'sindhuli', 'bagmati', 'कृषक', '', '1', '0', '1', '1', '1', '1', '1', '1', '1', '1', '0'),
(3, 'fsdfsdf', 'dsfdsf', '4444444444', 'fdsf', 'fdsfsdfdsfds', 'fdffdsfdsf', 'fdsfds', 'कृषक', 'fdsfsd', '0', '0', '0', '0', '1', '0', '0', '1', '0', '0', '0'),
(4, 'kdkdkd', 'fgdfgdfsfgdf', '9844042585', 'fsdfsdf', 'fdsfds', 'fdsfds', 'fdsfsdf', 'कृषक', 'kdkdkd', '0', '0', '1', '0', '0', '1', '0', '1', '0', '0', '0'),
(5, 'Pradip ', 'Fuyal', '9844042525', 'anythng', 'kamalmai', 'sindhuli', 'bagmati', 'कृषक', 'pradip', '0', '1', '0', '1', '1', '0', '0', '1', '0', '0', '0'),
(6, 'dfgfdg', 'fgfgf', 'gggggggggg', 'gfgfdgfd', 'gfdgfd', 'gfdgfdgfd', 'gfdgdfg', 'कृषक', 'gfdgfdg', '0', '0', '0', '0', '0', '0', '1', '1', '0', '0', '0'),
(7, 'Kumar', 'Dulal', '9844042582', 'Madhutar', 'Kamalamai', 'Sindhuli', 'Bagmati', 'कृषक', 'kumar123', '1', '0', '0', '1', '0', '0', '1', '0', '0', '0', '0');

-- --------------------------------------------------------

--
-- Table structure for table `messages`
--

CREATE TABLE `messages` (
  `messageid` int(11) NOT NULL,
  `senderid` int(11) NOT NULL,
  `usermessage` varchar(2000) NOT NULL,
  `updateddate` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `messages`
--

INSERT INTO `messages` (`messageid`, `senderid`, `usermessage`, `updateddate`) VALUES
(1, 2, 'fdsfsdfdsfdsdsafsa', '2022-05-06'),
(2, 2, 'fdsfsdfdsfdsdsafsafdf', '2022-05-06'),
(3, 2, 'fdsfds', 'शुक्रबार ३१, अस'),
(4, 2, 'fdsfds', 'शुक्रबार ३१, अस'),
(5, 2, 'fdsfdsdsfdsfds', 'शुक्रबार ३१, असार २०७९'),
(6, 2, 'fdsfdsfdsfsdf', 'शनिबार ३२, असार २०७९'),
(7, 2, 'dfsffdsf', 'शनिबार ३२, असार २०७९'),
(8, 2, 'dfsffdsf', 'शनिबार ३२, असार २०७९'),
(9, 2, 'dfsffdsf', 'शनिबार ३२, असार २०७९'),
(10, 2, 'Tapai ko lagi Testo msg lekdai xu .', 'शनिबार ३२, असार २०७९'),
(11, 2, 'fsdfdsfsd', 'आइतबार ०१, श्रावण २०७९'),
(12, 2, 'Helloo ', 'आइतबार ०१, श्रावण २०७९'),
(13, 7, 'fdsfdsf', 'आइतबार ०१, श्रावण २०७९'),
(14, 7, 'fdsfdsf', 'आइतबार ०१, श्रावण २०७९'),
(15, 7, 'fdfgdsf', 'आइतबार ०१, श्रावण २०७९'),
(16, 1, 'fgdfgfdg', 'आइतबार ०१, श्रावण २०७९');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `newsid` int(50) NOT NULL,
  `newstitle` varchar(200) NOT NULL,
  `newsintro` varchar(500) NOT NULL,
  `newsdesc` varchar(2000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`newsid`, `newstitle`, `newsintro`, `newsdesc`) VALUES
(1, 'प्रदेशको बजेटमा किसानलाई अनुदानको ओइरो', '३ असार, काठमाडौं । कृषि तथा पशुपन्छी विकासका लागि सातवटा प्रदेशले २१ अर्ब ३७ करोड रुपैयाँ बजेट विनियोजन गरेका छन् ।', 'खाद्य सुरक्षा र कृषिमार्फत रोजगारी सिर्जनालाई बजेटमा प्राथमिकता दिइएको प्रदेश सरकारले दाबी गरेका छन् । अन्य प्रदेशको तुलनामा लुम्बिनी प्रदेशले कृषिका लागि सबैभन्दा धेरै ४ अर्ब रुपैयाँ छुट्ट्याएको छ ।\r\n\r\nबागमतीले तीन अर्ब ५० करोड बजेट कृषि विकासलाई विनियोजन गर्दा गण्डकी प्रदेशले सबैभन्दा कम दुई अर्ब ६० करोड रुपैयाँ कृषिका लागि विनियोजन गरेको छ ।\r\n\r\nअघिल्लो वर्ष प्रचारमुखी कृषि बजेट ल्याएका प्रदेश सरकारले योपटक भने कृषक अनुदान र कृषिमा प्राविधिक रोजगारी सिर्जना र सिँचाइ पूर्वाधार विकासमा बढी जोड दिएका छन् ।\r\n\r\nसरकार परिवर्तनका कारण गण्डकी प्रदेशले कृषिका कार्यक्रम बजेटमा तोक्न सकेको छैन । प्रदेश २ मा मन्त्रालय फुटाइएका कारण बजेट र कार्यक्रम निचोरिन पुगेको मन्त्रालयले बताएको छ ।\r\n\r\nकेन्द्र सरकारको सिको गर्दै सबै प्रदेशले मुख्यमन्त्रीको नाममा कृषि बजेट वितरण र कृषक पुरस्कारका कार्यक्रमहरूलाई निरन्तरता दिएका छन् । कणर्ाली प्रदेशले त उत्कृष्ट किसानलाई सुनको हलो अंकित तक्मा दिएर सम्मान गर्ने घोषणा गरेको छ ।\r\n\r\nयस्तो छ प्रदेशगत कृषि बजेट र प्रमुख कार्यक्रम –\r\n\r\nप्रदेश एक\r\n\r\nप्रदेश १ ले आगामी आर्थिक वर्षका लागि कृषि तथा पशुपन्छी विकासमा दुई अर्ब ९० करोड रुपैयाँ बजेट विनियोजन गरेको छ । चालू आर्थिक वर्षमा ३ अर्ब ८३ करोड १६ लाख बजेट कार्यान्वयन गरिरहेको प्रदेशको कृषि बजेट यस वर्ष झण्डै एक अर्ब रुपैयाँले घटेको छ ।\r\n\r\nखाद्य तथा पोषण सुरक्षा, खाद्यान्न, तरकारी, फलफूल, माछामासु लगायतको उत्पादन, उत्पादकत्व वृद्धि गर्न उन्नत प्रविधिको प्रयोग र कृषिको व्यवसायीकरणलाई बजेटले प्राथमिकतामा राखेको छ । कृषिमा नयाँ काम गर्ने युवाका लागि भन्दै ‘मेरो कृषि मेरो पौरख’ नाराका साथ प्रदेश प्रमुख नवप्रवर्तन कृषि कार्यक्रमलाई यस वर्ष पनि निरन्तरता दिइएको छ ।\r\n\r\nबजेटमा प्रमुख कार्यक्रम\r\n\r\n· प्रदेश प्रमुख नवप्रर्वतन कृषि कार्यक्रम ५ करोड ७२ लाख\r\n· सहुलियतपूर्ण ब्याजअनुदानमा ४ करोड\r\n· टी टेष्टिङ, रिसर्च एण्ड प्रोमोसन सेन्टर\r\n· हुलाकी मार्ग लक्षित बाख्रापालन कार्यक्रम\r\n· कुखुरा, बट्टाई, अस्टि्रच, हाँस पालनलाई प्रोत्साहन\r\n· संरक्षित कृषि सुरक्षित बचत अवधारणा कार्यान्वयन\r\n· चिया, अलैंची, अदुवा जस्ता नगदेबालीको उत्पादन तथा गुणस्तर सुधार\r\n· मासु तथा अण्डामा आत्मनिर्भरता उन्मुख कार्यक्रम\r\n· नश्ल सुधार तथा धुल'),
(2, 'पढाइसँगै विद्यार्थीले शुरु गरे बाँझो जमिनमा तरकारी खेती', '१९ माघ, गोरखा । मंगलबार गोरखाको पालुङटार नगरपालिका–९ स्थित शेराफाँट पुग्दा विद्यार्थीहरु खेतीमा व्यस्त देखिन्थे । ', '‘स्कुल नजिकै रहेको फाँटमा दश रोपनी बाँझो जमिन थियो,’ उनले भने, ‘त्यही जग्गा पाँच वर्षका लागि भाडामा लिएर विद्यार्थीलाई आलु खेती गर्न सिकाएका हौं ।’ त्यस्तै विद्यालय हाता नजिकै रहेको आठ रोपनी बाँझो जमिनमा तरकारी खेती गर्न लगाइएको उनले बताए । उनका अनुसार उक्त जग्गा पनि पाँच वर्षका लागि भाडामा लिइएको छ । सो जग्गामा करेला, घिरौंला, काँक्रो लगायतका तरकारी लगाइएको बताउँदै उनले थपे, ‘यहाँ लगाउने बिरुवा पनि विद्यार्थी आफैंले उत्पादन गरेका हुन् ।’\r\n\r\nचालु शैक्षिक सत्रबाट विद्यालयले कक्षा ९ मा कृषि धार तर्फको पाठ्यक्रम लागू गरेको छ । प्रयोगात्मक परीक्षाका लागि पनि जमिन आवश्यक पर्ने भएकाले कुल १८ रोपनी जग्गा भाडामा लिएर विद्यार्थीलाई खेती गर्न सिकाइएको उनले बताए । ‘अहिले ९ कक्षामा कृषि धारको पढाइ शुरु गरेका छौं, अर्काे वर्ष दश कक्षामा पनि शुरु गर्छाै,’ उनले भने । कक्षा १२ सम्मका लागि अनुमति पाइसकेको उनले जानकारी दिए ।\r\n\r\nकक्षा ९ मा हाल २८ जना विद्यार्थी छन् । एक बजेसम्म उनीहरु कक्षाकोठामै पढ्छन् र बाँकी समय खेतीमा व्यस्त हुन्छन् । बाँझो जमिनमा खेती गर्न विद्यार्थीहरु पनि उत्साहित छन् । ‘हामी किसानकै छोरा हौं, घरमा पनि खेती गर्दै आएका छौं,’ विद्यार्थी विपल सेडाईंले भने, ‘घरमा विधि नपुर्‍याइ आफ्नै ढंगले लगाउथ्यौं । तर यहाँ पढाइसँगै खेती गर्ने विधिबारे पनि जानकार भएका छौं ।’ विद्यालयमा सिकेको सीपले घरमा खेती गर्न पनि सहज भएको अर्का विद्यार्थी मोहित कुवँरले बताए ।\r\n\r\nकृषि बिषय पढाउनका लागि विद्यालयले दुई जना कृषि प्रशिक्षकलाई करारमा नियुक्ति गरेको छ । उनीहरुले विद्यार्थीलाई खेती सम्बन्धी सैद्धान्तिक र प्रयोगात्मक सिप सिकाउँछन् । जैविक र प्राङ्गारिक मलको प्रयोग गरेर जैविक बिधिबाट खेती गर्न सिकाइएको प्रशिक्षक प्रमिला अधिकारीले बताइन् ।\r\n\r\nपढ्दै र सिक्दै अभियानलाई आत्मसाथ गर्दै कृषि बिषयको अध्ययापन शुरु गरिएको विद्यालयले जनाएको छ । खेतीबाट उत्पादित तरकारीलाई स्थानीय बजारमा बिक्री गर्ने र आम्दानीको २५ प्रतिशत विद्यार्थीलाई र बाँकी विद्यालयमा राखिने प्रअ सेडाईंले जानकारी दिए ।'),
(3, 'तरकारी खेती गर्दा दुःखका दिन विदा', '३० फागुन, बर्दिवास ।  ‘गरे के हुँदैन’ भन्ने आहान महोत्तरी जिल्लाको भङ्गाहा नगरपालिका–४ का उत्साही युवाले खेतीपातीबाटै राम्रो', ' ३० फागुन, बर्दिवास ।  ‘गरे के हुँदैन’ भन्ने आहान महोत्तरी जिल्लाको भङ्गाहा नगरपालिका–४ का उत्साही युवाले खेतीपातीबाटै राम्रो आर्जन गरेर चरितार्थ गरेका छन् ।\r\n\r\n                    रोजगारीका लागि विदेश जान साहुले ऋण नपत्याउँदा राहदानी घरमा थन्क्याएका सो बस्तीका उत्साही युवाले सामूहिक प्रयत्नबाट खेतीपातीबाटै केही वर्षभित्रै राम्रो आम्दानी गरेर सो आहान चरितार्थ गरेका हुन् ।\r\n                    ‘पासपोर्ट बनाएर विदेश जान साहुका घर/घर धाइयो’ सो बस्तीका ३७ वर्षीय किसान चन्देश्वर राय दनुवारले पाँच वर्ष पहिलेको कुरा सम्झँदै भने, “कसैले ऋण नपत्याएपछि जग्गा ठेक्कामा लिएर तरकारी खेती गर्न थालियो,अब चैं दुःख र अभावका दिन सकिएजस्तो लागेको छ ।”\r\n\r\n                    ऋण नपाएर जिङ्राएर बसेको बेला जिल्ला कृषि विकास कार्यालय महोत्तरीका कर्मचारीको प्रेरणाले श्री गढीमाई कृषि सहकारी संस्था गठन गरी दिलोज्यानले खेतीमा लागेका सो बस्तीका चन्देश्वरसहितका युवाले केही वर्षभित्रै गरेका प्रगति सबैका लागि उदाहरणीय बनेको छ ।\r\n\r\n                    शुरुमा जग्गा ठेक्कामा लिएर तरकारी खेती गरेका संस्थामा आबद्ध युवाले चार÷पाँच वर्षभित्रै केही जग्गासमेत जोडेर घर व्यवहार राम्ररी चल्न थालेको बताएका छन् । अहिले सो बस्तीका ३० जना संस्थामा आबद्ध छन् ।\r\n\r\n                    पछिल्ला पाँच बर्षयता तरकारी बालीमा ओल, आलु, कोबी, भाण्टा मात्र नभएर अन्नबालीमा पनि नयाँ प्रयोग गरेर चैते धान र गहुँको खेती शुरु गरिएको संस्थाका अध्यक्ष सत्यनारायण यादवले बताए । आफ्नो बस्तीमा उत्पादित ओल (तरकारी विशेष) र अन्नबालीमा चैते धान तथा गहुँको उन्नत बीउ नै मुलुकका विभिन्न भेगमा संस्थाले पठाउन थालेको यादवले जानकारी दिए ।\r\n\r\n                    “हामीले जिल्ला कृषि विकास कार्यालयका विज्ञकै रेखदेखमा ओल, चैते धान र गहुँको बीउ उत्पादन शुरु गरेका छौँ”, अध्यक्ष यादवले भने, “अहिले हाम्रो ध्यान नै माग भएको ठाउँमा बीउ आपूर्ति गर्नमा केन्द्रित छ, पूर्वमा सुनसरी, मोरङ र पश्चिममा डडेलधुरासम्म हामीले उत्पादन गरेको बीउ गइरहेको छ ।”\r\n\r\n                    यसपालि मात्रै कृषि सामग्री संस्थानको समन्वयमा विजय र तिलोत्तमा जातका उन्नत गहुँको बीउ ११० क्विन्टल बाहिर पठाइएको संस्थाले जनाएको छ ।\r\n\r\n                    त्यसैगरी, हर्दिनाथ, राम र बासमती जातका'),
(4, 'ज्यामरुककोटका किसान केरा र तरकारी खेतीतर्फ आकर्षित ', '२६ चैत, गलेश्वर । म्याग्दीको ज्यामरुककोटका किसान केरा र तरकारी खेतीतर्फ आकर्षित भएका छन् ।', '२६ चैत, गलेश्वर । म्याग्दीको ज्यामरुककोटका किसान केरा र तरकारी खेतीतर्फ आकर्षित भएका छन् । अन्य बाली निर्वाहमुखीमात्र भएपछि बेनी नगरपालिका–२ ज्यामरुककोटका किसान केरा र तरकारी खेतीतर्फ आकर्षित भएका हुन् ।\r\n\r\nधान, मकै, गहुँलगायतका अन्नबाली उत्पादन हुने जग्गामा बेनी नगरपालिका– २ ज्यामरुककोटको खबरा र बगरफाँटका तीन दर्जन भन्दा बढी किसानले अन्नबाली हुने जमीन केरा र तरकारी उत्पादनमा उपयोग गर्न थालेका छन ।\r\nखबराका किसान चन्द्रबहादुर कार्कीले केरा र तरकारी खेती सुरु गरेपछि वार्षिक रु १२ लाखसम्म आम्दानी गर्न थालेको बताए । अन्नबालीको तुलनामा केरा र तरकारी खेतीबाट तीन गुना बढी फाइदा हुने कार्कीको भनाइ छ । उनले करीब चार रोपनी क्षेत्रफलमा २०० बोट केरा लगाएका छन् भने पाँच रोपनी जग्गामा तरकारी खेती गरेका छन् । बजारमा तरकारी र केराको माग उच्च रहेकाले आफ्नो उत्पादनले राम्रो बजार पाएको उनको भनाइ छ ।\r\n\r\nखबराकै अर्का किसान शोभित शर्मा (सापकोटा) ले पनि आठ रोपनी जग्गामा तरकारी र केराखेती गरेका छन् । केरा र तरकारी बेचेर वार्षिक रु आठ लाख भन्दा बढी कमाइ गर्दै आएका शर्माले गत वर्षदेखि विभिन्न प्रजातिका फलफूल समेत लगाएका छन् । आठ वर्षदेखि तरकारी खेती सुरु गरेका सापकोटाले यस वर्ष केराका सय बोट थपेर ७०० बोट केरा लगाउने योजना बनाएको बताए । ‘राम्रो स्याहार संरक्षण गरेपछि एक घरी केराबाट तीन हजारसम्म कमाइ गर्न सकिन्छ”, किसान शर्माले भने ।\r\n\r\nबगरफाँटका खिमबहादुर कार्की, दुर्गाबहादुर थापा, बेदप्रसाद उपाध्यायलगायतका किसानले पनि धान फल्ने खेतमा केरा खेती गरेका छन् । यहाँका किसानले ५० मुरी धान उत्पादन हुने खेतभरि अहिले केरा र तरकारी खेती लगाएर हरियाली बनाएका छन् । केरा बालीभित्र घुसुवा बाली (अदुवा,बेसार) समेत लगाएर यहाँका किसानले दोहोरा आम्दानी गरिरहेका कृषि प्राविधिकले बताएका छन् ।'),
(5, 'hello aaa', 'fdfsf dfdsfsdfdsf dlfjksdjflkdsj ', 'this is it'),
(6, 'Only for begineers', 'fdfsf dfdsfsdfdsf dlfjksdjflkdsj ', 'this is it');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `krishi`
--
ALTER TABLE `krishi`
  ADD PRIMARY KEY (`userid`);

--
-- Indexes for table `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`messageid`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`newsid`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `krishi`
--
ALTER TABLE `krishi`
  MODIFY `userid` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `messageid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `newsid` int(50) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
