import React from 'react'
import { View, Text, ScrollView } from 'react-native'
import HeaderItem from '../../components/HomeComponents/HeaderItem'



export default function AboutUs() {
    return (
        <View>
            <HeaderItem />
            <Text style={{ fontSize: 20, width: "100%", textAlign: "center", bottom: 20 }}>ABOUT US</Text>
            <ScrollView
                showsHorizontalScrollIndicator={false}
                style={{ backgroundColor: "green", height: "100%" }} ><Text>
                    नेपालमा कृषि विकास कार्यक्रम कार्यान्वयनको संस्थागत विकासको थालनी विक्रम सम्वत् १९७८ मा चारखालमा स्थापित कृषि अड्डाबाट शूरु भएको पाईन्छ । वि.स. १९८२ मा सिंहदरबार परिसरमा कृषि प्रदर्शन फार्म र वि.स. १९९४ मा कृषि परिषदको गठन भए पछि देश भित्र कृषि फार्महरु खोल्ने, सर्वेक्षण कार्यहरु गर्ने जस्ता कार्यहरु थप हुदै गए । त्यसै गरि वि.स. १९९८ मा त्रिपुरेश्वरमा भेटेरिनरी अस्पतालको स्थापना भई वि.स. २००० मा मकवानपुरको चित्लांग र नुवाकोटको ककनीमा भेडा फार्महरुको स्थापना गरि पशु सेवाको विकासको प्रारमभ भएको पाईन्छ । नेपालमा वैदिककाल देखिनै भूमिलाई राज्यको अधिनमा राखी भूमिको उपयोग गर्नेले निश्चित कर राज्यलाई बुझाउनु पर्ने प्रचनल थियो । राजा रामशाहले जग्गा प्रशासनमा हले, पाटे, कोदाले, माटो मुरी, विजन, माना आदिको आधारमा जग्गाको ईकाई तोकी लगत राख्ने व्यवस्था गरेका थिए भने राजा जयस्थिति मल्ल्ले जग्गा नाप जाँच गराउने र विर्ता जग्गा विक्रि गर्न र बन्धक राख्न पाउने नियम बसालेका थिए । नेपालमा यसरी कृषि पशु सेवा, भूमि सुधारको शूरुवात भएकोे र समयको माग अनुसार क्रमिक रुपमा विकासको आयामहरु थपिदै गई हालको अवस्थामा कृषि, पशु सेवा, भूमि सुधार तथा सहकारीले आफनो छुट्टै पहिचान स्थापित गरेको छ ।

                    नेपालमा संघियता लागु भए पश्चात हालको अवस्थामा प्रदेशस्तरमा भूमि व्यवस्था, कृषि तथा सहकारी मन्त्रालयको स्थापना भएको छ । देश विकासको आयामलाई मुर्त रुप दिन सबै क्षेत्रको महत्पुर्ण योगदान रहेको छ । नेपाली अर्थतन्त्रको मुख्य क्षेत्रको रुपमा कृषि तथा पशुपालन रहेको छ । राष्ट्रिय अर्थतन्त्रको विकास तथा समृद्धिको लागि कृषि तथा पशुपालनको समग्र विकास गरि व्यवसायीकरण गर्नु आजको प्रमुख आवश्यकता रहेको छ । उत्पादनको साधनको रुपमा रहेको प्रचुर जमिन र दुई तिहाई उत्पादक शतिmको रुपमा रहेको किसानलाई समेटेर कृषि तथा पशुपालन क्षेत्रको  उत्पादन तथा उत्पादकत्व  बृद्धि गरि राष्ट्रिय पुँजकिो सिर्जना गर्न सकिन्छ । कृषि तथा पशुपालन क्षेत्रको व्यवसायकिरण, आधुनिकिकरण तथा औधोगिकीकरण गर्दे कृषि तथा पशुजन्य उतपादनमा आत्मनिर्भर बनाउदै आयात प्रतिस्थापन र निर्यात प्रबद्र्धन गरि समाजको अग्रगामी रुपान्तरणको दिशामा अघि बढनु आजको प्रमुख आवशयकता रहेको छ ।

                    नेपाल विश्व व्यापार संगठन तथा विश्व पशु स्वास्थ्य संगठनको सदस्य राष्ट्र भएकोले सोको नीति अनुरुप विकासका साझेदारहरु संग समन्वय गरि कृषि तथा  पशुपालन क्षेत्रको विकासका कार्यहरु पुरा गर्नु पर्नेछ । दिगो विकासको लक्ष्यमा उल्लेख भए अनुरुप भोक अन्तय गर्न, खाध र पोषण सुरक्षामा सुधार ल्याउनको लागि कृषि तथा पशुपंक्षी क्षेत्रको विकास अपरिहार्य रहेको छ । कृषि तथा पशुपंक्षी विकासको क्षेत्रमा सार्वजनिक, निजी तथा सहकारी क्षेत्रको लगानी समुचित रुपमा बृद्धि गरि कृषि तथा पशुजन्य उत्पादनमा आत्मनिर्भर बनाउन सकिने प्रशस्त संभावना रहेको छ जसबाट देशको आर्थिक विकासमा योगदान पुरयाउनुको साथै समाबेशी रुपमा आर्थिक बृद्धिको प्रतिफल जनताहरु माझ पुरयाउन सकिने प्रबल संभावना रहेको छ ।

                    नेपालको संविधान २०७२ अनुसार सहकारी क्षेत्रलाई प्रबद्र्धन गर्दै राष्ट्रिय विकासमा अत्याधिक प्रयोग गर्ने र कृषि तथा भुमि सुधार सम्बनधी नीति अवलम्बन गरि भूमि व्यवस्थापन, भूमि प्रशासन र जग्गा नाप जाँच भूमि सुधार, भुउपयोग तथा चक्लाबन्दी सम्बन्धी नीति कानुन मापदण्डको तर्जुमा, कार्यान्वयन र नियमन पनि आजको आवश्यकता रहेको छ । तदअनुरुप नेपालको संविधानमा उल्ःलेख भए बमोजिम  प्रदेश न २ मा निशिचत  कार्य विवरण तोकी भूमि व्यवस्था, कृषि तथा सहकारी मन्त्रालयको स्थापन भई हाल कृयाशील रहेको छ । यसको मुख्य कार्य क्षेत्रको रुपमा कृषि, पशुपंक्षी, सहकारी तथा भूमि व्यवस्थापन रहेको छ ।



                </Text></ScrollView>
        </View >
    )
}
